if (window.console) {
    Function.prototype.makeMulti = function () {
      let l = new String(this);
      l = l.substring(l.indexOf("/*") + 3, l.lastIndexOf("*/"));
      return l;
    };
    let string = function () {
      /*

 ___       ________  ________   ________          ________  ___          ___  ___  ________  ________      
|\  \     |\   __  \|\   ___  \|\   ____\        |\_____  \|\  \        |\  \|\  \|\   __  \|\   ___  \    
\ \  \    \ \  \|\  \ \  \\ \  \ \  \___|         \|___/  /\ \  \       \ \  \\\  \ \  \|\  \ \  \\ \  \   
 \ \  \    \ \   __  \ \  \\ \  \ \  \  ___           /  / /\ \  \       \ \   __  \ \   __  \ \  \\ \  \  
  \ \  \____\ \  \ \  \ \  \\ \  \ \  \|\  \         /  /_/__\ \  \       \ \  \ \  \ \  \ \  \ \  \\ \  \ 
   \ \_______\ \__\ \__\ \__\\ \__\ \_______\       |\________\ \__\       \ \__\ \__\ \__\ \__\ \__\\ \__\
    \|_______|\|__|\|__|\|__| \|__|\|_______|        \|_______|\|__|        \|__|\|__|\|__|\|__|\|__| \|__|
                                                                                                           
                                                                                                           
                                                                                                           

      */
    };
    console.log(string.makeMulti());
    console.log("人海茫茫，相逢是缘");
    console.log("欢迎来到%c浪·徐老爷·子·星晨·寒的博客空间", "color:#1fc7b6;font-weight:bold");
    console.log("祝愿我们在抵达路的末端时，都不会后悔！");
    let string2 = function () {
      /*
──────▄▀▄─────▄▀▄
─────▄█░░▀▀▀▀▀░░█▄
─▄▄──█░░░░░░░░░░░█──▄▄
█▄▄█─█░░▀░░┬░░▀░░█─█▄▄█
                            
      */
    };
    console.log(string2.makeMulti());
  }